{"do_lower_case": true, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "cls_token_box": [0, 0, 0, 0], "sep_token_box": [1000, 1000, 1000, 1000], "pad_token_box": [0, 0, 0, 0], "pad_token_label": -100, "only_label_first_subword": true, "tokenize_chinese_chars": true, "strip_accents": null, "model_max_length": 512, "special_tokens_map_file": null, "name_or_path": "microsoft/layoutlmv2-base-uncased", "do_basic_tokenize": true, "never_split": null, "additional_special_tokens": null, "tokenizer_class": "LayoutLMv2Tokenizer", "processor_class": "LayoutLMv2Processor"}